/**
  ******************************************************************************
  * @file    bsp_mylib.c
  * @author  之风 
  * @version V1.0
  * @date    2019-6-12 晚
  * @brief   定义一些关于系统的函数
  ******************************************************************************
  * @attention
  *
  * 实验平台:无
  * 论坛    :无
  * 淘宝    :无
  *
  ******************************************************************************/
#include "bsp_mylib.h"

uint8_t MCU_ID[12];
uint8_t data_varify = 0;
/********************************************************************************
*   @fun    MCU_GetID
*   @brief  获取芯片ID
*   @param  无
*   @retval 无
*	@author 之风
*   @data   2019.6.12 晚
********************************************************************************/
void MCU_GetID(uint8_t *id)
{
    uint8_t *pID = (uint8_t *)(0x1FFFF7E8);
    uint8_t i;
    for (i = 0; i < 12; i++)
    {
        id[i] = pID[i];
    }
}

/********************************************************************************
*	@fun    ResetSystem
*   @brief  软件复位
*   @param  无
*   @retval 无
*	@author 之风
*   @data   2019.6.12 晚
********************************************************************************/
void ResetSystem(void)
{
    //	__set_FAULTMASK(1);//关闭所有中端
    NVIC_SystemReset(); //复位
}

/********************************************************************************
*   @fun        XOR_Verify
*   @brief      异或校验
*   @param      *pdata 传入直针 len 长度
*   @retval     data_varify
*   @author     之风
*   @data       2019.6.12 晚
********************************************************************************/
uint8_t XOR_Verify(uint8_t *pdata, uint8_t len)
{
    uint8_t num = 0;
    data_varify=0;
    for (num = 0; num < len; num++)
        data_varify ^= *pdata++; //首先进来data_varify给初值为0，0异或任何数都是原来的

    return data_varify;
}

/********************************************************************************
*   @fun    SunVerify_Fun
*   @brief  和校验
*   @param  *pdata 传入直针 len 长度
*   @retval 
*   @author 之风
*   @data   2019.6.12 晚
********************************************************************************/
uint8_t SunVerify_Fun(uint8_t *pdata, uint8_t len)
{
    uint8_t num = 0;
    data_varify=0;
    for (num = 0; num < len; num++)
        data_varify += *pdata++;
    return data_varify;
}

/********************************************************************************
* @fun	  C_SunVerify_Fun
* @brief  和校验后取反+1
* @param  *pdata 传入直针 len 长度
* @retval 
* @author 之风
* @data   2019.6.12 晚
********************************************************************************/
uint8_t C_SunVerify_Fun(uint8_t *pdata, uint8_t len)
{
    uint8_t num = 0;
    data_varify=0;
    for (num = 0; num < len; num++)
        data_varify += *pdata++;
    data_varify = (~data_varify) + 1;
    return data_varify;
}
/********************************************************************************
*   @fun		FindStr
*   @brief      在指定的数组里寻找指定的字符
*   @param      *a 要寻找的字符 buff 寻找的位置
*   @retval 
*	@author     之风
*   @data       2019.6.12 晚
********************************************************************************/
uint8_t FindStr(char *a, char *buff)
{
    if (strstr(buff, a) != NULL)
        return 1;
    else
        return 0;
}

/********************************************************************************
* @fun	  BCDToInt
* @brief  BCD转成整形
* @param  bcd c传入数据 len 转化数量
* @retval 无
* @author 之风
* @data   2019.11.4 晚
  ********************************************************************************/
uint8_t BCDToInt(uint8_t *bcd, uint8_t len) //BCD转十进制
{
    uint8_t num = 0;
    for (num = 0; num < len; num++)
    {
        *bcd = (0xff & (*bcd >> 4)) * 10 + (0xf & *bcd);
        bcd++;
    }
    return 0;
}

/********************************************************************************
* @fun	  DectoBCD
* @brief  十进制转换成BCD码
* @param  无
* @retval 无
* @author 之风
* @data   2019.11.4 晚
  ********************************************************************************/
void DectoBCD(uint16_t Dec, uint8_t *Bcd, int8_t length)
{
    int8_t i;
    uint16_t temp;
    for (i = length - 1; i >= 0; i--)
    {
        temp = Dec % 100;
        Bcd[i] = ((temp / 10) << 4) + ((temp % 10) & 0x0F);
        Dec /= 100;
    }
}

/********************************************************************************
*	@fun    Get_Bit_1_Num
*   @brief  计算一个变量里有多少个1
*   @param  data 要计算的值
*   @retval 有多少个1的数量
*	@author 之风
*   @data   2019.6.12 晚
********************************************************************************/
uint8_t Get_Bit_1_Num(uint32_t data)
{
    uint8_t num = 0;
    uint8_t count = 0;
    for (; num < 32; num++)
    {
        if (data & 1)
            count++;
        data >>= 1;
    }
    return count;
}

uint32_t my_timestamp = 0;
/********************************************************************************
*	@fun    Get_FunRunTimeStart
*   @brief  获取函数运行时间
*   @param 
*   @retval 
*	@author 之风
*   @data   2019.6.12 晚
********************************************************************************/
void Get_FunRunTimeStart(void)
{
    my_timestamp = HAL_GetTick();
}

/********************************************************************************
*	@fun    Get_FunRunTimeEnd
*   @brief  获取函数运行时间
*   @param 
*   @retval 
*	@author 之风
*   @data   2019.6.12 晚
********************************************************************************/
void Get_FunRunTimeEnd(void)
{
    //    SYS_DEBUG("T=%d\n",HAL_GetTick()-my_timestamp);
    SYS_DEBUG("T=%d\n", HAL_GetTick());
}

/*
*********************************************************************************************************
*    函 数 名: str_len
*    功能说明: 计算字符串长度.0是结束符
*    形    参: _str : 缓冲区
*    返 回 值: 无
*********************************************************************************************************
*/
int str_len(char *_str)
{
    int len = 0;

    while (*_str++)
        len++;
    return len;
}

/*
*********************************************************************************************************
*    函 数 名: str_cpy
*    功能说明: 复制字符串
*    形    参: tar : 目标缓冲区
*             src : 源缓冲区
*    返 回 值: 无
*********************************************************************************************************
*/
void str_cpy(char *_tar, char *_src)
{
    do
    {
        *_tar++ = *_src;
    } while (*_src++);
}

/*
*********************************************************************************************************
*    函 数 名: str_cmp
*    功能说明: 字符串比较
*    形    参: s1 : 字符串1
*              s2 : 字符串2
*    返 回 值: 0 表示相等 非0表示不等
*********************************************************************************************************
*/
int str_cmp(char *s1, char *s2)
{
    while ((*s1 != 0) && (*s2 != 0) && (*s1 == *s2))
    {
        s1++;
        s2++;
    }
    return *s1 - *s2;
}

/*
*********************************************************************************************************
*    函 数 名: str_copy
*    功能说明: 复制字符串
*    形    参: tar : 目标缓冲区
*             src : 源缓冲区
*    返 回 值: 无
*********************************************************************************************************
*/
void mem_set(char *_tar, char _data, int _len)
{
    while (_len--)
    {
        *_tar++ = _data;
    }
}

/*
*********************************************************************************************************
*    函 数 名: int_to_ascii
*    功能说明: 将整数转换为ASCII数组。支持负数。
*    形    参: _Number : 整数
*             _pBuf : 目标缓冲区, 存放转换后的结果。以0结束的字符串。
*             _len : ASCII字符个数, 字符串长度
*    返 回 值: 无
*********************************************************************************************************
*/
void int_to_str(int _iNumber, char *_pBuf, unsigned char _len)
{
    unsigned char i;
    int iTemp;

    if (_iNumber < 0) /* 负数 */
    {
        iTemp = -_iNumber; /* 转为正数 */
    }
    else
    {
        iTemp = _iNumber;
    }

    mem_set(_pBuf, ' ', _len);

    /* 将整数转换为ASCII字符串 */
    for (i = 0; i < _len; i++)
    {
        _pBuf[_len - 1 - i] = (iTemp % 10) + '0';
        iTemp = iTemp / 10;
        if (iTemp == 0)
        {
            break;
        }
    }
    _pBuf[_len] = 0;

    if (_iNumber < 0) /* 负数 */
    {
        for (i = 0; i < _len; i++)
        {
            if ((_pBuf[i] == ' ') && (_pBuf[i + 1] != ' '))
            {
                _pBuf[i] = '-';
                break;
            }
        }
    }
}

/*
*********************************************************************************************************
*    函 数 名: str_to_int
*    功能说明: 将ASCII码字符串转换成整数。 遇到小数点自动越过。
*    形    参: _pStr :待转换的ASCII码串. 可以以逗号，#或0结束。 2014-06-20 修改为非0-9的字符。
*    返 回 值: 二进制整数值
*********************************************************************************************************
*/
int str_to_int(char *_pStr)
{
    unsigned char flag;
    char *p;
    int ulInt;
    unsigned char i;
    unsigned char ucTemp;

    p = _pStr;
    if (*p == '-')
    {
        flag = 1; /* 负数 */
        p++;
    }
    else
    {
        flag = 0;
    }

    ulInt = 0;
    for (i = 0; i < 15; i++)
    {
        ucTemp = *p;
        if (ucTemp == '.') /* 遇到小数点，自动跳过1个字节 */
        {
            p++;
            ucTemp = *p;
        }
        if ((ucTemp >= '0') && (ucTemp <= '9'))
        {
            ulInt = ulInt * 10 + (ucTemp - '0');
            p++;
        }
        else
        {
            break;
        }
    }

    if (flag == 1)
    {
        return -ulInt;
    }
    return ulInt;
}

/*
*********************************************************************************************************
*    函 数 名: BEBufToUint16
*    功能说明: 将2字节数组(大端Big Endian次序，高字节在前)转换为16位整数
*    形    参: _pBuf : 数组
*    返 回 值: 16位整数值
*
*   大端(Big Endian)与小端(Little Endian)
*********************************************************************************************************
*/
uint16_t BEBufToUint16(uint8_t *_pBuf)
{
    return (((uint16_t)_pBuf[0] << 8) | _pBuf[1]);
}

/*
*********************************************************************************************************
*    函 数 名: LEBufToUint16
*    功能说明: 将2字节数组(小端Little Endian，低字节在前)转换为16位整数
*    形    参: _pBuf : 数组
*    返 回 值: 16位整数值
*********************************************************************************************************
*/
uint16_t LEBufToUint16(uint8_t *_pBuf)
{
    return (((uint16_t)_pBuf[1] << 8) | _pBuf[0]);
}

/*
*********************************************************************************************************
*    函 数 名: BEBufToUint32
*    功能说明: 将4字节数组(大端Big Endian次序，高字节在前)转换为16位整数
*    形    参: _pBuf : 数组
*    返 回 值: 16位整数值
*
*   大端(Big Endian)与小端(Little Endian)
*********************************************************************************************************
*/
uint32_t BEBufToUint32(uint8_t *_pBuf)
{
    return (((uint32_t)_pBuf[0] << 24) | ((uint32_t)_pBuf[1] << 16) | ((uint32_t)_pBuf[2] << 8) | _pBuf[3]);
}

/*
*********************************************************************************************************
*    函 数 名: LEBufToUint32
*    功能说明: 将4字节数组(小端Little Endian，低字节在前)转换为16位整数
*    形    参: _pBuf : 数组
*    返 回 值: 16位整数值
*********************************************************************************************************
*/
uint32_t LEBufToUint32(uint8_t *_pBuf)
{
    return (((uint32_t)_pBuf[3] << 24) | ((uint32_t)_pBuf[2] << 16) | ((uint32_t)_pBuf[1] << 8) | _pBuf[0]);
}

/*
*********************************************************************************************************
*    函 数 名: CaculTwoPoint
*    功能说明: 根据2点直线方程，计算Y值
*    形    参:  2个点的坐标和x输入量
*    返 回 值: x对应的y值
*********************************************************************************************************
*/
int32_t CaculTwoPoint(int32_t x1, int32_t y1, int32_t x2, int32_t y2, int32_t x)
{
    if (x2 == x1)
    {
        return 0;
    }
    return y1 + ((int64_t)(y2 - y1) * (x - x1)) / (x2 - x1);
}

/*
*********************************************************************************************************
*    函 数 名: CaculTwoPointFloat
*    功能说明: 根据2点直线方程，计算Y值。 浮点
*    形    参:  2个点的坐标和x输入量
*    返 回 值: x对应的y值
*********************************************************************************************************
*/
float CaculTwoPointFloat(float x1, float y1, float x2, float y2, float x)
{
    if (x2 == x1)
    {
        return 0;
    }
    return y1 + ((y2 - y1) * (x - x1)) / (x2 - x1);
}

/*
*********************************************************************************************************
*    函 数 名: BcdToChar
*    功能说明: 将BCD码转为ASCII字符。 比如 0x0A ==> 'A'
*    形    参: _bcd   ：输入的二进制数。必须小于16
*    返 回 值: 转换结果
*********************************************************************************************************
*/
char BcdToChar(uint8_t _bcd)
{
    if (_bcd < 10)
    {
        return _bcd + '0';
    }
    else if (_bcd < 16)
    {
        return _bcd - 10 + 'A';
    }
    else
    {
        return 0;
    }
}

/*
*********************************************************************************************************
*    函 数 名: HexToAscll
*    功能说明: 将二进制数组转换为16进制格式的ASCII字符串。每个2个ASCII字符后保留1个空格。
*              0x12 0x34 转化为 0x31 0x32 0x20 0x33 0x34 0x00  即 "1234"
*    形    参:     _pHex   ：输入的数据，二进制数组
*                _pAscii ：存放转换结果, ASCII字符串，0结束。1个二进制对应2个ASCII字符.
*    返 回 值: 转换得到的整数
*********************************************************************************************************
*/
void HexToAscll(uint8_t *_pHex, char *_pAscii, uint16_t _BinBytes)
{
    uint16_t i;

    if (_BinBytes == 0)
    {
        _pAscii[0] = 0;
    }
    else
    {
        for (i = 0; i < _BinBytes; i++)
        {
            _pAscii[3 * i] = BcdToChar(_pHex[i] >> 4);
            _pAscii[3 * i + 1] = BcdToChar(_pHex[i] & 0x0F);
            _pAscii[3 * i + 2] = ' ';
        }
        _pAscii[3 * (i - 1) + 2] = 0;
    }
}

/*
*********************************************************************************************************
*    函 数 名: AsciiToHex
*    功能说明: 将ASCII字符串转换为 二进制数组。自动过滤空格。
*              "FF 12 34 F0" 转化为 0xFF,0x12,0x34,0xF0
*    形    参: _pAscii ：存放转换结果, ASCII字符串，0结束。1个二进制对应2个ASCII字符.
*              _pHex   ：输入的数据，二进制数组      
*              _MaxLen : _pHex 数组最大长度
*    返 回 值: 转换数组长度. 
*********************************************************************************************************
*/
uint16_t AsciiToHex(char *_pAscii, uint8_t *_pHex, uint16_t _MaxLen)
{
    uint32_t hexlen;
    char buf[2];
    char idx = 0;
    char ch;

    hexlen = 0;
    while (*_pAscii != 0)
    {
        ch = *_pAscii;
        if (ch == ' ' || ch == '\t')
        {
            _pAscii++;
            continue;
        }

        if (((ch >= 'A') && (ch <= 'F')) ||
            ((ch >= 'a') && (ch <= 'f')) ||
            ((ch >= '0') && (ch <= '9')))
        {
            buf[idx++] = *_pAscii++;
            if (idx == 2)
            {
                _pHex[hexlen++] = TwoCharToInt(buf);

                if (hexlen == _MaxLen)
                {
                    break;
                }

                idx = 0;
            }
        }
        else
        {
            hexlen = 0; /* 格式错误，返回0 */
            break;
        }
    }

    return hexlen;
}

/*
*********************************************************************************************************
*    函 数 名: AsciiToUint32
*    功能说明: 变长的 ASCII 字符转换为32位整数  ASCII 字符以空格或者0结束 。 支持16进制和10进制输入
*    形    参: *pAscii ：要转换的ASCII码
*    返 回 值: 转换得到的整数
*********************************************************************************************************
*/
uint32_t AsciiToUint32(char *pAscii)
{
    char i;
    char bTemp;
    char bIsHex;
    char bLen;
    char bZeroLen;
    uint32_t lResult;
    uint32_t lBitValue;

    /* 判断是否是16进制数 */
    bIsHex = 0;
    if ((pAscii[0] == '0') && ((pAscii[1] == 'x') || (pAscii[1] == 'X')))
    {
        bIsHex = 1;
    }

    lResult = 0;
    // 最大数值为 4294967295, 10位+2字符"0x" //
    if (bIsHex == 0)
    { // 十进制 //
        // 求长度 //
        lBitValue = 1;

        /* 前导去0 */
        for (i = 0; i < 8; i++)
        {
            bTemp = pAscii[i];
            if (bTemp != '0')
                break;
        }
        bZeroLen = i;

        for (i = 0; i < 10; i++)
        {
            if ((pAscii[i] < '0') || (pAscii[i] > '9'))
                break;
            lBitValue = lBitValue * 10;
        }
        bLen = i;
        lBitValue = lBitValue / 10;
        if (lBitValue == 0)
            lBitValue = 1;
        for (i = bZeroLen; i < bLen; i++)
        {
            lResult += (pAscii[i] - '0') * lBitValue;
            lBitValue /= 10;
        }
    }
    else
    { /* 16进制 */
        /* 求长度 */
        lBitValue = 1;

        /* 前导去0 */
        for (i = 0; i < 8; i++)
        {
            bTemp = pAscii[i + 2];
            if (bTemp != '0')
                break;
        }
        bZeroLen = i;
        for (; i < 8; i++)
        {
            bTemp = pAscii[i + 2];
            if (((bTemp >= 'A') && (bTemp <= 'F')) ||
                ((bTemp >= 'a') && (bTemp <= 'f')) ||
                ((bTemp >= '0') && (bTemp <= '9')))
            {
                lBitValue = lBitValue * 16;
            }
            else
            {
                break;
            }
        }
        lBitValue = lBitValue / 16;
        if (lBitValue == 0)
            lBitValue = 1;
        bLen = i;
        for (i = bZeroLen; i < bLen; i++)
        {
            bTemp = pAscii[i + 2];
            if ((bTemp >= 'A') && (bTemp <= 'F'))
            {
                bTemp -= 0x37;
            }
            else if ((bTemp >= 'a') && (bTemp <= 'f'))
            {
                bTemp -= 0x57;
            }
            else if ((bTemp >= '0') && (bTemp <= '9'))
            {
                bTemp -= '0';
            }
            lResult += bTemp * lBitValue;
            lBitValue /= 16;
        }
    }
    return lResult;
}

/*
*********************************************************************************************************
*    函 数 名: CharToInt
*    功能说明: 1个HEX格式ASCII字符转换为整数值0-F
*    形    参: chr : 字符
*    返 回 值: 整数值
*********************************************************************************************************
*/
uint8_t CharToInt(char _ch)
{
    uint8_t itemp;

    if ((_ch >= '0') && (_ch <= '9'))
    {
        itemp = _ch - '0';
    }
    else if (_ch >= 'a' && _ch <= 'f')
    {
        itemp = _ch - 'a' + 0x0A;
    }
    else if (_ch >= 'A' && _ch <= 'F')
    {
        itemp = _ch - 'A' + 0x0A;
    }
    else
    {
        itemp = 0;
    }

    return itemp;
}

/*
*********************************************************************************************************
*    函 数 名: TwoCharToInt
*    功能说明: 2个HEX格式ASCII字符转换为整数值0-F
*    形    参: chr : 字符
*    返 回 值: 整数值
*********************************************************************************************************
*/
uint8_t TwoCharToInt(char *_ch)
{
    uint8_t temp;

    temp = CharToInt(_ch[0]) * 16;
    temp += CharToInt(_ch[1]);

    return temp;
}

/*
*********************************************************************************************************
*    函 数 名: str_to_int2
*    功能说明: 将ASCII码字符串转换成整数。 遇到非0-9的字符结束。数字前面不能有空格。
*    形    参: _pStr :待转换的ASCII码串. 可以以逗号，#或0结束。 2014-06-20 修改为非0-9的字符。
*    返 回 值: 二进制整数值
*********************************************************************************************************
*/
int str_to_int2(char *_pStr)
{
    unsigned char flag;
    char *p;
    int ulInt;
    unsigned char i;
    unsigned char ucTemp;

    p = _pStr;
    if (*p == '-')
    {
        flag = 1; /* 负数 */
        p++;
    }
    else
    {
        flag = 0;
    }

    ulInt = 0;
    for (i = 0; i < 15; i++)
    {
        ucTemp = *p;

        if ((ucTemp >= '0') && (ucTemp <= '9'))
        {
            ulInt = ulInt * 10 + (ucTemp - '0');
            p++;
        }
        else
        {
            break;
        }
    }

    if (flag == 1)
    {
        return -ulInt;
    }
    return ulInt;
}

/*
*********************************************************************************************************
*    函 数 名: str_to_int3
*    功能说明: 将ASCII码字符串转换成整数 （用于ini文件）。 遇到空格和TAB自动略过，遇到小数点和非0-9字符结束
*    形    参: _pStr :待转换的ASCII码串，前面可以有空格和tab，结束是非0-9字符。
*    返 回 值: 二进制整数值
*********************************************************************************************************
*/
int str_to_int3(char *_pStr)
{
    unsigned char state = 0;
    unsigned char flag = 0;
    char *p;
    int ulInt;
    unsigned char ucTemp;

    p = _pStr;

    ulInt = 0;

    while (1)
    {
        ucTemp = *p++;

        if (state == 0)
        {
            if (ucTemp == ' ' || ucTemp == '\t')
            {
                continue;
            }
            else
            {
                if (ucTemp == '-')
                {
                    flag = 1; /* 是负数 */
                }
                else
                {
                    ulInt = ulInt * 10 + (ucTemp - '0');
                    state = 1;
                }
            }
        }
        else if (state == 1)
        {
            if ((ucTemp >= '0') && (ucTemp <= '9'))
            {
                ulInt = ulInt * 10 + (ucTemp - '0');
            }
            else
            {
                break;
            }
        }
    }

    if (flag == 1)
    {
        return -ulInt;
    }
    return ulInt;
}

/*
*********************************************************************************************************
*    函 数 名: ip_str_decode
*    功能说明: 带小数点的IP字符串，转换为4字节数组
*    形    参: _ipstr :待转换的ASCII码串
*              _out : 存放结果二进制整数值
*    返 回 值: 1表示OK， 0表示格式错误
*********************************************************************************************************
*/
uint8_t ip_str_decode(char *_ipstr, uint8_t *_out)
{
    char *p;
    int ip1, ip2, ip3, ip4;

    //192.168.1.12
    //192.168.1.20-30

    p = _ipstr;

    ip1 = str_to_int2(p);

    p = strchr(p, '.');
    if (p == 0)
    {
        goto err_ret; // 格式异常，丢弃
    }
    p++;
    ip2 = str_to_int2(p);

    p = strchr(p, '.');
    if (p == 0)
    {
        goto err_ret; // 格式异常，丢弃
    }
    p++;
    ip3 = str_to_int2(p);

    p = strchr(p, '.');
    if (p == 0)
    {
        goto err_ret; // 格式异常，丢弃
    }
    p++;
    ip4 = str_to_int2(p);

    if (ip1 >= 0 && ip1 <= 255 && ip2 >= 0 && ip2 <= 255 &&
        ip3 >= 0 && ip3 <= 255 && ip4 >= 0 && ip4 <= 255)
    {
        _out[0] = ip1;
        _out[1] = ip2;
        _out[2] = ip3;
        _out[3] = ip4;
        return 1;
    }

err_ret:
    return 0;
}

/*
*********************************************************************************************************
*    函 数 名: GetHigh16OfFloat
*    功能说明: 得到浮点数的高16位（stm32为小端）
*    形    参: _ff ：浮点数
*    返 回 值: 转换得到浮点数的高16位整数
*********************************************************************************************************
*/
uint16_t GetHigh16OfFloat(float _ff)
{
    uint16_t temp;
    uint8_t *p;

    p = (uint8_t *)&_ff; /* 将浮点数 */
    temp = (p[3] << 8) + p[2];

    return temp;
}

/*
*********************************************************************************************************
*    函 数 名: GetLow16OfFloat
*    功能说明: 得到浮点数的低16位（stm32为小端）
*    形    参: _ff ：浮点数
*    返 回 值: 转换得到浮点数的低16位整数
*********************************************************************************************************
*/
uint16_t GetLow16OfFloat(float _ff)
{
    uint16_t temp;
    uint8_t *p;

    p = (uint8_t *)&_ff;
    temp = (p[1] << 8) + p[0];

    return temp;
}

/*
*********************************************************************************************************
*    函 数 名: Get32BitOfFloat
*    功能说明: 得到浮点数的32位（stm32为小端）
*    形    参: _ff ：浮点数
*    返 回 值: 转换得到浮点数的32位整数
*********************************************************************************************************
*/
uint32_t Get32BitOfFloat(float _ff)
{
    uint32_t temp;
    uint8_t *p;

    p = (uint8_t *)&_ff;
    temp = (p[3] << 24) + (p[2] << 16) + (p[1] << 8) + p[0];

    return temp;
}

/*
*********************************************************************************************************
*    函 数 名: float_isnan
*    功能说明: 判断单精度浮点数是否有效
*    形    参: _ff ：浮点数
*    返 回 值: 0表示有效， 1表示无效
*********************************************************************************************************
*/
uint8_t float_isnan(float _ff)
{
    if (isnan(_ff))
    {
        return 1;
    }
    return 0;
}

/*
*********************************************************************************************************
*    函 数 名: BEBufToFloat
*    功能说明: 将4字节数组转换为浮点数
*    形    参: _pBuf : 数组
*    返 回 值: 16位整数值
*********************************************************************************************************
*/
float BEBufToFloat(uint8_t *_pBuf)
{
    float f;
    uint8_t buf[4];

    buf[0] = _pBuf[3];
    buf[1] = _pBuf[2];
    buf[2] = _pBuf[1];
    buf[3] = _pBuf[0];

    f = *(float *)buf;

    return f;
}

/*
*********************************************************************************************************
*    函 数 名: FloatToBEBuf
*    功能说明: 将浮点数转换为4字节数组
*    形    参: f : 浮点数; _pBuf : 数组
*    返 回 值: 16位整数值
*********************************************************************************************************
*/
void FloatToBEBuf(float _f, uint8_t *_pBuf)
{
    float f;
    uint8_t *p;

    f = _f;
    p = (uint8_t *)&f;

    _pBuf[0] = p[3];
    _pBuf[1] = p[2];
    _pBuf[2] = p[1];
    _pBuf[3] = p[0];
}

/*
*********************************************************************************************************
*    函 数 名: strlwr
*    功能说明: 将字符串转换为小写. 需要 #include <ctype.h>
*    形    参: str 字符串
*    返 回 值: 字符串
*********************************************************************************************************
*/
char *strlwr(char *str)
{
    char *orign = str;

    for (; *str != 0; str++)
    {
        *str = tolower(*str);
    }
    return orign;
}

/*
*********************************************************************************************************
*    函 数 名: strupr
*    功能说明: 将字符串转换为大写. 需要 #include <ctype.h>
*    形    参: str 字符串
*    返 回 值: 字符串
*********************************************************************************************************
*/
char *strupr(char *str)
{
    char *orign = str;

    for (; *str != 0; str++)
    {
        *str = toupper(*str);
    }
    return orign;
}

/*
*********************************************************************************************************
*    函 数 名: StrUTF8ToGBK
*    功能说明: 将UTF8字符串转换GBK字符串
*    形    参: utf8 输入字符串   
*              gbk  输出字符串
*              gbk_size 字符串size
*    返 回 值: 字符串
*********************************************************************************************************
*/
char *StrUTF8ToGBK(char *utf8, char *gbk, uint16_t gbk_size)
{
    uint8_t code1, code2;
    char *_ptr;
    char *_pOut;
    uint16_t len = 0;

    _ptr = utf8;
    _pOut = gbk;

    /* 开始循环处理字符 */
    while (*_ptr != 0)
    {
        code1 = *_ptr; /* 读取字符串数据， 该数据可能是ascii代码，也可能汉字代码的高字节 */
        if (code1 < 0x80)
        {
            if (len + 1 < gbk_size)
            {
                *_pOut++ = code1;

                len++;
            }
        }
        else
        {
            /* 解读 UTF-8 编码非常简单。
                如果一个字节的第一位是0，则这个字节单独就是一个字符；如果第一位是1，则连续有多少个1，就表示当前字符占用多少个字节。
                UNICODE 最后一个二进制位开始，依次从后向前填入格式中的x，多出的位补0
        
                110XXXXX  10XXXXXX           -- 支持
                1110XXXX  10XXXXXX 10XXXXXX  -- 支持
                11110XXX  10XXXXXX 10XXXXXX 10XXXXXX  -- 本转换程序不支持
            */
            {
                uint8_t code3;
                uint32_t unicode1;
                uint16_t gb;

                if ((code1 & 0xE0) == 0xC0) /* 2字节 */
                {
                    code2 = *++_ptr;
                    if (code2 == 0)
                    {
                        break;
                    }
                    unicode1 = ((uint32_t)(code1 & 0x1F) << 6) + (code2 & 0x3F);
                }
                else if ((code1 & 0xF0) == 0xE0) /* 3字节 */
                {
                    code2 = *++_ptr;
                    code3 = *++_ptr;
                    if (code2 == 0 || code3 == 0)
                    {
                        break;
                    }
                    unicode1 = ((uint32_t)(code1 & 0x0F) << 12) + ((uint32_t)(code2 & 0x3F) << 6) + (code3 & 0x3F);
                }
                else if ((code1 & 0xF8) == 0xF0) /* 4字节 */
                {
                    code2 = *++_ptr;
                    if (code2 == 0)
                    {
                        break;
                    }
                }
                else
                {
                    code2 = *++_ptr;
                    if (code2 == 0)
                    {
                        break;
                    }
                }

                /* 将UNICODE码转换为GB2312 */
                if (unicode1 > 0xFFFF)
                {
                    break;
                }
                //                gb = ff_convert(unicode1, 0);    /* Unicode -> OEM */

                code1 = gb >> 8;
                code2 = gb;

                if (len + 2 < gbk_size)
                {
                    *_pOut++ = code1;
                    *_pOut++ = code2;

                    len += 2;
                }
            }
        }

        _ptr++;
    }

    *_pOut = 0;

    return gbk;
}

/*
*********************************************************************************************************
*    函 数 名: CheckBlankBuf
*    功能说明: 检查一个缓冲区的数值是否空（空值判定有给定的参数_EmptyValue决定）
*    形    参:  _buf 数据缓冲区
*				_len : 数据字节数
*               _EmptyValue : 空值，一般为0xFF 或者0x00
*    返 回 值: 1表示是空，0表示不空
*********************************************************************************************************
*/
uint8_t CheckBlankBuf(const char *_buf, uint32_t _len, uint8_t _EmptyValue)
{
    uint32_t i;

    for (i = 0; i < _len; i++)
    {
        if (_buf[i] != _EmptyValue)
        {
            return 0; /* 不空 */
        }
    }

    return 1; /* 缓冲区为空 */
}